Autodesk.Revit.DB.DefinitionGroup.Definitions
The Definitions property returns an object that contains all the shared parameter
definitions within the group.
Remarks: A known definition can be retrieved, by name, using the Item property on the Definitions
object. A new definition can be created by using the Create method. The Create method takes two
parameters, a string for name and a type. If the creation of the definition was successful then
an object representing the definition is returned by the Create method.

Autodesk.Revit.DB.DefinitionGroup.Name
Returns the name of the parameter group.

Autodesk.Revit.DB.DefinitionGroup
The DefinitionGroup is a container that is used to hold shared parameter definitions on disk.
Remarks: Groups are used for logical arrangement of the shared parameters into meaningful sets.
Through the DefinitionGroup object new shared parameter definitions can be made.